papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/HronTurekFsi3/base/quasiMonolitic/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    plate
    {
        type            zeroGradient;
        value           uniform 0;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    inlet
    {
        type            zeroGradient;
        value           uniform 0;
    }

    cylinder
    {
        type            zeroGradient;
        value           uniform 0;
    }

    bottom
    {
        type            zeroGradient;
        value           uniform 0;
    }

    top
    {
        type            zeroGradient;
        value           uniform 0;
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}

// ************************************************************************* //
