papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/HronTurekFsi3/base/quasiMonolitic/system/fluid/fvSolution.monolithic
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Up
    {
        solver    petsc;

        options
        {
            snes_type newtonls;
            snes_linesearch_type basic;
            snes_rtol "1e-6";
            snes_stol "1e-6";
            snes_monitor;
            snes_converged_reason;
            snes_max_linear_solve_fail "100";

            snes_mf_operator;

            ksp_type lgmres;
            ksp_gmres_restart "200";
            ksp_rtol "1e-4";
            ksp_converged_reason;
            ksp_max_it "1000";

            // Nested velocity/pressure Schur split (2-D: block_size 3)
            pc_type fieldsplit;
            pc_fieldsplit_type schur;
            pc_fieldsplit_schur_fact_type upper;
            pc_fieldsplit_schur_precondition selfp;
            pc_fieldsplit_block_size "3";
            pc_fieldsplit_0_fields "0,1";
            pc_fieldsplit_1_fields "2";

            // Velocity sub-block: bjacobi + ILU(0)
            fieldsplit_0_ksp_type preonly;
            fieldsplit_0_pc_type bjacobi;
            fieldsplit_0_sub_pc_type ilu;
            fieldsplit_0_sub_pc_factor_levels "0";

            // Pressure Schur complement: HYPRE BoomerAMG
            fieldsplit_1_ksp_type preonly;
            fieldsplit_1_pc_type hypre;
            fieldsplit_1_pc_hypre_type boomeramg;
            fieldsplit_1_pc_hypre_boomeramg_max_iter "1";
            fieldsplit_1_pc_hypre_boomeramg_strong_threshold "0.6";
            fieldsplit_1_pc_hypre_boomeramg_grid_sweeps_up "1";
            fieldsplit_1_pc_hypre_boomeramg_grid_sweeps_down "1";
            fieldsplit_1_pc_hypre_boomeramg_agg_nl "1";
            fieldsplit_1_pc_hypre_boomeramg_agg_num_paths "1";
            fieldsplit_1_pc_hypre_boomeramg_max_levels "25";
            fieldsplit_1_pc_hypre_boomeramg_coarsen_type HMIS;
            fieldsplit_1_pc_hypre_boomeramg_interp_type ext+i;
            fieldsplit_1_pc_hypre_boomeramg_P_max "1";
            fieldsplit_1_pc_hypre_boomeramg_truncfactor "0.3";
        }
    }

    D // fluid mesh motion
    {
        solver    petsc;

        options
        {
            snes_type newtonls;
            snes_linesearch_type basic;
            snes_rtol "1e-6";
            snes_stol "1e-6";
            snes_max_it "100";
            snes_monitor;
            snes_converged_reason;

            snes_mf;
            snes_mf_operator;

            ksp_type lgmres;
            ksp_gmres_restart "100";
            ksp_converged_reason;

            pc_type bjacobi;
            sub_pc_type lu;

            snes_lag_preconditioner_persists true;
            snes_lag_preconditioner "-2";
        }
    }

    "p|pFinal"
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        minIter         1;
        maxIter         1000;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        scaleCorrection true;
        directSolveCoarsest false;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    cellMotionU
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        minIter         1;
        maxIter         100;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        scaleCorrection true;
        directSolveCoarsest false;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    "U|UFinal"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
        minIter         1;
    }

    // Physics PC inner solvers (used only with pc_type physics)

    dU
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       0;
        relTol          0;
        minIter         1;
        maxIter         1;
    }

    dp
    {
        solver          GAMG;
        tolerance       0;
        relTol          0;
        minIter         1;
        maxIter         1;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     1;
        nFinestSweeps   1;
        scaleCorrection true;
        directSolveCoarsest false;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }
}

PIMPLE
{
    momentumPredictor   on;
    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 1;
}

// ************************************************************************* //
